tutorials/MPPICcolumn/constant/dynamicMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}

dynamicFvMesh   dynamicMotionSolverFvMesh;

motionSolver    solidBody;
solidBodyMotionFunction  oscillatingLinearMotion;
amplitude       (0.3 0 0);
omega           0.1; // rad/s  (.5 rps)
